ПредопределенныеЗначенияПодсистема/src/Catalogs/ПредопределенныеНастройки/ПредопределенныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредопределенныеНастройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенияПредопределенныхЗначений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПредопределенныеЗначенияПодсистема/src/Enums/ТипыЗначенияПредопределенныхЗначений/ТипыЗначенияПредопределенныхЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенияПредопределенныхЗначений</name>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Массив</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Ссылка</name>
  </enumValues>
  <enumValues>
    <name>КлючЗначение</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаЗначений</name>
  </enumValues>
  <enumValues>
    <name>КаталогПредопределенныхНастроек</name>
    <comment>Группа настроек, без установки значения</comment>
  </enumValues>
</mdclass:Enum>

ПредопределенныеЗначенияПодсистема/src/Catalogs/ПредопределенныеНастройки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

	Если ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.Массив Тогда
		
		МассивЗначение = Хранилище.Получить();
		Если ТипЗнч(МассивЗначение) = Тип("Массив") Тогда
			ПредставлениеМассива = СтрСоединить(МассивЗначение, ", ");
			ПредставлениеЗначения = СтрШаблон(НСтр("ru = 'Массив[%1]'"), ПредставлениеМассива);
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений Тогда
		
		ТаблицаЗначенийНастройки =  Хранилище.Получить();
		Если ТипЗнч(ТаблицаЗначенийНастройки) = Тип("ТаблицаЗначений") Тогда			
			МассивИменКолонок = Новый Массив;
			Для Каждого Колонка Из ТаблицаЗначенийНастройки.Колонки Цикл
				МассивИменКолонок.Добавить(Колонка.Имя);
			КонецЦикла;
			
			ПредставлениеТаблицы = СтрСоединить(МассивИменКолонок, ", ");
			ПредставлениеЗначения = СтрШаблон(НСтр("ru = 'Таблица значений[%1]'"), ПредставлениеТаблицы);
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.КлючЗначение Тогда
		
		ТаблицаЗначенийНастройки =  Хранилище.Получить();
		Если ТипЗнч(ТаблицаЗначенийНастройки) = Тип("ТаблицаЗначений") Тогда
			ПредставлениеТаблицы = СтрСоединить(ТаблицаЗначенийНастройки.ВыгрузитьКолонку("Ключ"), ", ");
			ПредставлениеЗначения = СтрШаблон(НСтр("ru = 'Ключ и значение[%1]'"), ПредставлениеТаблицы);
		ИначеЕсли ТипЗнч(ТаблицаЗначенийНастройки) = Тип("Соответствие") Тогда
			МассивПредставлений = Новый Массив;
			Для Каждого КлючЗначение Из ТаблицаЗначенийНастройки Цикл 
				
				КлючЗначениеПредставление = СтрШаблон(НСтр("ru = '[%1: %2]'"), КлючЗначение.Ключ, КлючЗначение.Значение);
				МассивПредставлений.Добавить(КлючЗначениеПредставление);
				
			КонецЦикла;
			ПредставлениеЗначения = СтрСоединить(МассивПредставлений, ", ");
		КонецЕсли;
		
	ИначеЕсли ЭтоГруппа Тогда 
		ПредставлениеЗначения = СокрЛП(Наименование);
	Иначе
		ПредставлениеЗначения = СокрЛП(Значение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
